src/cf/Documents/уатОперацияСВагонами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатОперацияСВагонами</Name>
			<BasedOn>
				<xr:Item>Document.уатНатурныйЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатОборотыВагоновПоСтанции</xr:Item>
				<xr:Item>AccumulationRegister.уатЗаказыГрузоотправителей</xr:Item>
				<xr:Item>InformationRegister.уатСостояниеТС</xr:Item>
				<xr:Item>AccumulationRegister.уатОборотыВагоновПоСтанцииОстатки</xr:Item>
				<xr:Item>AccumulationRegister.уатГрузыКПеревозке_уэ</xr:Item>
				<xr:Item>InformationRegister.уатСтатусыГрузов_уэ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОперацийСВагоном</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НатурныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатНатурныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вагоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вагон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатОперацияСВагонами/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Если Не ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	ТЗВагоны = Объект.Вагоны.Выгрузить();
	ТЗВагоны.Свернуть("ЗаказНаТС");
	
	Заказы = ТЗВагоны.ВыгрузитьКолонку("ЗаказНаТС");
	
	Документы.уатЗаказГрузоотправителя.ПолучитьЗаказыДляПерепроведения(Заказы, Объект.Операция);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Подразделение = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура МестоположениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("СтанцияНачалоВыбораЗавершение", ЭтотОбъект);
	ОтборПоТипуПункта = Новый Структура("ТипПункта", ПредопределенноеЗначение("Справочник.уатТипыПунктов.ЖДстанция"));
	ОткрытьФорму("Справочник.уатПунктыНазначения.ФормаВыбора", Новый Структура("Отбор", ОтборПоТипуПункта), ЭтотОбъект,,,,
		ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНачалоВыбораЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Объект.Местоположение = Результат;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Вагоны

&НаКлиенте
Процедура ВагоныВагонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВагоныВагонНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.уатТС.ФормаВыбора", Новый Структура("ЖД", Истина), ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВагоныВагонНачалоВыбораЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Вагоны.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Вагон = Результат;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьПоНатурномуЛисту(Команда)
	Если Объект.Вагоны.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(Объект.НатурныйЛист) Тогда
			Оповещение = Новый ОписаниеОповещения("ЗаполнитьВагоныПоНатурномуЛистуФрагмент", ЭтотОбъект);
		Иначе
			Оповещение = Новый ОписаниеОповещения("ЗаполнитьВагоныПоДокументу", ЭтотОбъект, "НатурныйЛист");
		КонецЕсли;
		ТекстВопроса = НСтр("en='Clear the tabular section before filling?';ru='Очистить табличную часть перед заполнением?'");
		ТекстЗаголовка = НСтр("en='Clear the table';ru='Очистка таблицы'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, ТекстЗаголовка);
		Возврат;
	Иначе
		Если ЗначениеЗаполнено(Объект.НатурныйЛист) Тогда
			ЗаполнитьВагоныПоНатурномуЛисту();
		Иначе
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("Очистить", Ложь);
			ОповещениеОВыборе = Новый ОписаниеОповещения("ЗавершениеВыбораДокументаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ЗаполнитьПо", "НатурныйЛист");
			ОткрытьФорму("КритерийОтбора.уатВагоныВДиспозицииИНатурныхЛистах.ФормаСписка",ПараметрыОткрытия,,,,,
			ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДислокации(Команда)
	Если Объект.Вагоны.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьВагоныПоДокументу", ЭтотОбъект, "Дислокация");
		ТекстВопроса = НСтр("en='Clear the tabular section before filling?';ru='Очистить табличную часть перед заполнением?'");
		ТекстЗаголовка = НСтр("en='Clear the table';ru='Очистка таблицы'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, ТекстЗаголовка);
		Возврат;
	Иначе
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("Очистить", Ложь);
		ОповещениеОВыборе = Новый ОписаниеОповещения("ЗавершениеВыбораДокументаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗаполнитьПо", "Дислокация");
		ОткрытьФорму("КритерийОтбора.уатВагоныВДиспозицииИНатурныхЛистах.ФормаСписка",ПараметрыОткрытия,,,,,
		ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуОперации(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьДатуОперацииЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.уатОперацияСВагонами.Форма.ФормаВыбораДаты",,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьВагоныПоДокументу(Результат, ДопПараметры) Экспорт
	ДополнительныеПараметры = Новый Структура();
	Очистить = ?(Результат = КодВозвратаДиалога.Да, Истина, Ложь);
	ДополнительныеПараметры.Вставить("Очистить", Очистить);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ЗавершениеВыбораДокументаДляЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗаполнитьПо", ДопПараметры);
	ОткрытьФорму("КритерийОтбора.уатВагоныВДиспозицииИНатурныхЛистах.ФормаСписка",ПараметрыОткрытия,,,,,
	ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВагоныПоНатурномуЛистуФрагмент(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Вагоны.Очистить();
	КонецЕсли;
	ЗаполнитьВагоныПоНатурномуЛисту();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораДокументаДляЗаполнения(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСписокТСПоДокументу(Результат, ДопПараметры);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТСПоДокументу(Документ, ДопПараметры)
	Если ДопПараметры.Очистить Тогда
		Объект.Вагоны.Очистить();
	КонецЕсли;
	Модифицрованность = Истина;
	Для каждого ТекВагон Из Документ.Вагоны Цикл
		НоваяСтрока = Объект.Вагоны.Добавить();
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.уатНатурныйЛист") Тогда
			НоваяСтрока.Вагон = ТекВагон.НомерВагона;
		ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.уатДислокацияВагонов") Тогда
			НоваяСтрока.Вагон = ТекВагон.Вагон;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуОперацииЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = Дата("00010101") Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	Для каждого ТекСтрока Из Объект.Вагоны Цикл
		ТекСтрока.ДатаОперации = Результат;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВагоныПоНатурномуЛисту()
	Для каждого ТекВагон Из Объект.НатурныйЛист.Вагоны Цикл
		НоваяСтрока = Объект.Вагоны.Добавить();
		НоваяСтрока.Вагон = ТекВагон.НомерВагона;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
